     A*----
     A* Name:       HFPARDAT.PF
     A* Description: DATA CONTENT FILE
     A* Author:      Agustín Aceves Osuna
     A* Date:        20240302
     A*----
     A          R FHDREG
     A            FHDTAB         3A         TEXT('TABLE ID')
     A            FHDKEY        30A         TEXT('TABLE KEY')
     A            FHDDAT        50A         TEXT('TABLE DATA')
